{
    "/bin/view/Documentation/": {
        "/bin/view/Documentation/BrickDocumentation/": {
            "/bin/view/XWiki/admin": {
                "/bin/view/XWiki/admin": {}
            },
            "/bin/view/Documentation/BrickDocumentation/Event-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/WhenStartedBrick/": {
                    "text": "When Started Brick: If you use this block, the script will start immediately when the scene starts. A scene is the beginning of your program. A scene is a new view in your program in which other elements can be displayed and different interactions can take place. You can have many scenes for different phases in your program. For example one scene for the intro, one scene for the main menu, one for the first level, one for the second level and so on. With simpler programs, a single scene can also suffice, then the beginning of your program is also the beginning of the scene (as in our small example below)."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenBrick/": {
                    "text": "When Brick: Runs the script when the object is tapped."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenTouchDownBrick/": {
                    "text": "When Touch Down Brick: Runs the script when the screen is touched."
                },
                "/bin/view/Documentation/BrickDocumentation/BroadcastReceiverBrick/": {
                    "text": "Broadcast Receiver Brick: With this block your object listens for a specific broadcast message and then runs the script when the message is received. Useful to communicate between objects and tell them when to do something."
                },
                "/bin/view/Documentation/BrickDocumentation/BroadcastBrick/": {
                    "text": "Broadcast Brick: Sends a specified message to all objects and the background. Useful to communicate between objects and tell them when to do something."
                },
                "/bin/view/Documentation/BrickDocumentation/BroadcastWaitBrick/": {
                    "text": "Broadcast Wait Brick: Sends a specified message to all objects and the background. The object that sends the message waits until all objects, that received the message, have finished their scripts. Then the initial script continues."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenConditionBrick/": {
                    "text": "When Condition Brick: Waits until the specified value or function becomes true and then runs the script."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenBounceOffBrick/": {
                    "text": "When Bounce Off Brick: Runs the script when the object collides physically with another object. Other objects motion types will have to be set to physical."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenBackgroundChangesBrick/": {
                    "text": "When Background Changes Brick: Runs the script when background changes to a certain background. Needs more than one background."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenClonedBrick/": {
                    "text": "When Cloned Brick: Tells a created clone of an object what to do."
                },
                "/bin/view/Documentation/BrickDocumentation/CloneBrick/": {
                    "text": "Clone Brick: Creates a clone (temporary duplicate) of the specified object with all its attributes up to the point that the brick was activated. It can clone itself or other objects."
                },
                "/bin/view/Documentation/BrickDocumentation/DeleteThisCloneBrick/": {
                    "text": "Delete This Clone Brick: Deletes the current clone"
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Control-Bricks/": {
                "/bin/view/XWiki/admin": {},
                "/bin/view/Documentation/BrickDocumentation/WaitBrick/": {
                    "text": "Wait Brick: This block pauses the script for the specified amount of time and then continues with the next block.."
                },
                "/bin/view/Documentation/BrickDocumentation/NoteBrick/": {
                    "text": "Note Brick: Makes a note for programming issues. Does not have any relevance for the script’s execution."
                },
                "/bin/view/Documentation/BrickDocumentation/ForeverBrick/": {
                    "text": "Forever Brick: Creates a loop. All bricks between “Forever” and “End of loop” will be repeated forever."
                },
                "/bin/view/Documentation/BrickDocumentation/IfThenLogicBrick/": {
                    "text": "If Then Logic Brick: Creates an if-else-query. If a specified events happen, it will continue the script there, otherwise beneath the else-brick."
                },
                "/bin/view/Documentation/BrickDocumentation/IfLogicBrick/": {
                    "text": "If Logic Brick: Creates an if-query without an else. If an event happens, the bricks between the “if” and the “end if” will be activated."
                },
                "/bin/view/Documentation/BrickDocumentation/WaitUntilBrick/": {
                    "text": "Wait Until Brick: Lets the script wait until a specified value is true, then continues with the next brick."
                },
                "/bin/view/Documentation/BrickDocumentation/RepeatBrick/": {
                    "text": "Repeat Brick: Creates a loop and repeats the bricks within the loop a specified amount of times."
                },
                "/bin/view/Documentation/BrickDocumentation/RepeatUntilBrick/": {
                    "text": "Repeat Until Brick: Creates a loop. Will repeat its loop until a specified value becomes true and then continues with the next brick."
                },
                "/bin/view/Documentation/BrickDocumentation/ForVariableFromToBrick/": {
                    "text": "For Variable From To Brick: Represents a for-loop. Repeats for every integer from a specified value to another specified value. "
                },
                "/bin/view/Documentation/BrickDocumentation/ForItemInUserListBrick/": {
                    "text": "For Item In User List Brick: Represents a for-each-loop. Will iterate through the specified list by saving each item in the specified variable. The loop iterates from the first item in the list to the last. E.g. if the list contains two items: {'Hello', 'World'}, in the first iteration the variable will contain 'Hello' and in the second 'World'."
                },
                "/bin/view/Documentation/BrickDocumentation/ContinueSceneBrick/": {
                    "text": "Continue Scene Brick: Continues a scene that already has started. Requires at least two scenes. Script will continue at the point it left the scene."
                },
                "/bin/view/Documentation/BrickDocumentation/SceneStartBrick/": {
                    "text": "Scene Start Brick: Starts a new scene. Requires at least two scenes in the program. A scene is a sort of mini-program within the program. It provides all objects and scripts from scratch. Variables can have the scope to be seen in every scene."
                },
                "/bin/view/Documentation/BrickDocumentation/ExitStageBrick/": {
                    "text": "Exit Stage Brick: Exits the program and continues the workflow in the programing view."
                },
                "/bin/view/Documentation/BrickDocumentation/StopScriptBrick/": {
                    "text": "Stop Script Brick: Stops either this script, all scripts or other scripts of the object."
                },
                "/bin/view/Documentation/BrickDocumentation/WaitTillIdleBrick/": {
                    "text": "Wait Till Idle Brick: Let’s the script wait until all other scripts have stopped. This includes all script from all other objects. Scripts can be stopped through the stop brick or when terminated by lack of further operations. "
                },
                "/bin/view/Documentation/BrickDocumentation/WhenClonedBrick/": {
                    "text": "When Cloned Brick: Tells a created clone of an object what to do."
                },
                "/bin/view/Documentation/BrickDocumentation/CloneBrick/": {
                    "text": "Clone Brick: Creates a clone (temporary duplicate) of the specified object with all its attributes up to the point that the brick was activated. It can clone itself or other objects."
                },
                "/bin/view/Documentation/BrickDocumentation/DeleteThisCloneBrick/": {
                    "text": "Delete This Clone Brick: Deletes the current clone"
                },
                "/bin/view/Documentation/BrickDocumentation/BroadcastReceiverBrick/": {
                    "text": "Broadcast Receiver Brick: With this block your object listens for a specific broadcast message and then runs the script when the message is received. Useful to communicate between objects and tell them when to do something."
                },
                "/bin/view/Documentation/BrickDocumentation/BroadcastBrick/": {
                    "text": "Broadcast Brick: Sends a specified message to all objects and the background. Useful to communicate between objects and tell them when to do something."
                },
                "/bin/view/Documentation/BrickDocumentation/BroadcastWaitBrick/": {
                    "text": "Broadcast Wait Brick: Sends a specified message to all objects and the background. The object that sends the message waits until all objects, that received the message, have finished their scripts. Then the initial script continues."
                },
                "/bin/view/Documentation/BrickDocumentation/TapAtBrick/": {
                    "text": "Tap At Brick: Simulates a single tap at a specified position of the touchscreen. This brick basically simulates your finger."
                },
                "/bin/view/Documentation/BrickDocumentation/TapForBrick/": {
                    "text": "Tap For Brick: Simulates a touch at a specified position for a specified amount of time at your touchscreen. This brick basically simulates your finger and can be used for longer touches."
                },
                "/bin/view/Documentation/BrickDocumentation/TouchAndSlideFromTo/": {
                    "text": "Touch And Slide From To: Simulates a touch on the screen. The touch moves in the given time from the first position to the second position. This block simulates your finger and can be used for swipes of various length."
                },
                "/bin/view/Documentation/BrickDocumentation/OpenInBrowser/": {
                    "text": "Open In Browser: Opens the provided URL in the browser of the device."
                },
                "#": {
                    "text": ": Made by Catrobaters, for Catrobaters."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Motion-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/PlaceAtBrick/": {
                    "text": "Place At Brick: Places an object at the specified coordinates. You can choose each coordinate individually."
                },
                "/bin/view/Documentation/BrickDocumentation/SetXBrick/": {
                    "text": "Set X Brick: Sets the x-coordinate of an object to a specified value. By default objects will be placed at x: 0 and x: 0, which is the center of your screen."
                },
                "/bin/view/Documentation/BrickDocumentation/SetYBrick/": {
                    "text": "Set Y Brick: Sets the y-coordinate of an object to a specified value. By default objects will be placed at x: 0 and y: 0, which is the center of your device."
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeXByNBrick/": {
                    "text": "Change X By N Brick: Changes the x-coordinate of an object by a specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeYByNBrick/": {
                    "text": "Change Y By N Brick: Changes the y-coordinate of an object by a specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/GoToBrick/": {
                    "text": "Go To Brick: The object will be placed either at the touch position, a random position or the position of a different object."
                },
                "/bin/view/Documentation/BrickDocumentation/IfOnEdgeBounceBrick/": {
                    "text": "If On Edge Bounce Brick: Lets the object bounce if it touches an edge. To constantly bounce, use the Forever-brick in addition."
                },
                "/bin/view/Documentation/BrickDocumentation/MoveNStepsBrick/": {
                    "text": "Move N Steps Brick: The object moves specified steps (which are pixels on the screen) parallel to the X-coordinate. Negative values will let the object move to the left, positive ones to the right."
                },
                "/bin/view/Documentation/BrickDocumentation/TurnLeftBrick/": {
                    "text": "Turn Left Brick: Turn the object to the left by a specified value of degrees."
                },
                "/bin/view/Documentation/BrickDocumentation/TurnRightBrick/": {
                    "text": "Turn Right Brick: Turn the object to the left by a specified value of degrees."
                },
                "/bin/view/Documentation/BrickDocumentation/PointInDirectionBrick/": {
                    "text": "Point In Direction Brick: Lets the object point in a specified direction."
                },
                "/bin/view/Documentation/BrickDocumentation/PointToBrick/": {
                    "text": "Point To Brick: Lets the object point towards another object. At least two objects are necessary."
                },
                "/bin/view/Documentation/BrickDocumentation/SetRotationStyleBrick/": {
                    "text": "Set Rotation Style Brick: Will change the objects rotation style to either left-right only, all-around or don’t rotate. By default the object will rotate all-around."
                },
                "/bin/view/Documentation/BrickDocumentation/GlideToBrick/": {
                    "text": "Glide To Brick: Lets the object glide to a specified place within a specified time. More seconds will result into a slower gliding."
                },
                "/bin/view/Documentation/BrickDocumentation/GoBackLayerBrick/": {
                    "text": "Go Back Layer Brick: Puts an object back a specified layer. It will appear behind other objects and will be visible through transparent objects."
                },
                "/bin/view/Documentation/BrickDocumentation/ComeToFrontBrick/": {
                    "text": "Come To Front Brick: Will take the object to the front of the screen. All other objects will appear behind it."
                },
                "/bin/view/Documentation/BrickDocumentation/VibrationBrick/": {
                    "text": "Vibration Brick: Lets the phone vibrate for a specified time."
                },
                "/bin/view/Documentation/BrickDocumentation/SetPhysicsObjectTypeBrick/": {
                    "text": "Set Physics Object Type Brick: Sets the object’s motion type to a specified behaviour: moving and bouncing under gravity / not moving under gravity, but others bounce off... / not moving or bouncing under gravity (default)"
                },
                "/bin/view/Documentation/BrickDocumentation/WhenBounceOffBrick/": {
                    "text": "When Bounce Off Brick: Runs the script when the object collides physically with another object. Other objects motion types will have to be set to physical."
                },
                "/bin/view/Documentation/BrickDocumentation/SetVelocityBrick/": {
                    "text": "Set Velocity Brick: Sets the velocity of the object measured in steps/second. You can choose the direction by adjusting the coordinates."
                },
                "/bin/view/Documentation/BrickDocumentation/TurnLeftSpeedBrick/": {
                    "text": "Turn Left Speed Brick: Lets the object spin left in with the specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/TurnRightSpeedBrick/": {
                    "text": "Turn Right Speed Brick: Lets the object spin right with the specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/SetGravityBrick/": {
                    "text": "Set Gravity Brick: Sets the gravity of the object to a specified value. The object will react like physical object."
                },
                "/bin/view/Documentation/BrickDocumentation/SetMassBrick/": {
                    "text": "Set Mass Brick: Sets the object’s mass to a specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/SetBounceBrick/": {
                    "text": "Set Bounce Brick: Sets the bounce factor of the object to a specified value. If the bounce factor is 100%, the object will lose no speed when bouncing."
                },
                "/bin/view/Documentation/BrickDocumentation/SetFrictionBrick/": {
                    "text": "Set Friction Brick: Sets the friction of the object to a specified value. If the friction is set to 0%, the object will not lose speed by travelling."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Sound-Bricks/": {
                "/bin/view/XWiki/FirstaAnta": {},
                "/bin/view/Documentation/BrickDocumentation/PlaySoundBrick/": {
                    "text": "Play Sound Brick: Plays a sound and continues with the next brick immediately."
                },
                "/bin/view/Documentation/BrickDocumentation/PlaySoundAndWaitBrick/": {
                    "text": "Play Sound And Wait Brick: Plays a sound and waits until it has ended before continuing with the next brick."
                },
                "/bin/view/Documentation/BrickDocumentation/StopSoundBrick/": {
                    "text": "Stop Sound Brick: Stops the specified sound."
                },
                "/bin/view/Documentation/BrickDocumentation/StopAllSoundsBrick/": {
                    "text": "Stop All Sounds Brick: Stops all sounds being played on all objects and stages. "
                },
                "/bin/view/Documentation/BrickDocumentation/SetVolumeToBrick/": {
                    "text": "Set Volume To Brick: Sets object’s sound volume to a specified value. You can set the volume level for each object. To play two sounds at the same time with different volume levels, use two objects. Volume is set by default to 100 and ranges between 0 and 100."
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeVolumeByNBrick/": {
                    "text": "Change Volume By N Brick: Changes object’s sound volume by a specified amount. You can set the volume level for each object. To play two sounds at the same time with different volume levels, use two objects. Volume is set by default to 100 and ranges between 0 and 100."
                },
                "/bin/view/Documentation/BrickDocumentation/SpeakBrick/": {
                    "text": "Speak Brick: Speaks a phrase with a computer generated voice and continues with the next brick immediately."
                },
                "/bin/view/Documentation/BrickDocumentation/SpeakAndWaitBrick/": {
                    "text": "Speak And Wait Brick: Speaks a phrase with a computer generated voice and waits until it has ended before continuing with the next brick."
                },
                "/bin/view/Documentation/BrickDocumentation/AskSpeechBrick/": {
                    "text": "Ask Speech Brick: Speaks a phrase with a computer generated voice and stores the spoken answer, converted as text, in a variable. Requires an internet connection to convert."
                },
                "/bin/view/Documentation/BrickDocumentation/StartListeningBrick/": {
                    "text": "Start Listening Brick: Starts the voice recognition and stores the recognised words in the specified variable. The recognition will stop automatically if there is nothing spoken anymore."
                },
                "/bin/view/Documentation/BrickDocumentation/SetListeningLanguageBrick/": {
                    "text": "Set Listening Language Brick: Sets the listening voice to a specified language. This ensures that the device understands and can accurately process the specified language. The languages can be chosen from a drop-down menu. The system will then recognise spoken words in this language."
                },
                "/bin/view/Documentation/BrickDocumentation/SetInstrumentBrick/": {
                    "text": "Set Instrument Brick: This brick changes the instrument to the specified instrument. After using this brick, all notes are played with this instrument."
                },
                "/bin/view/Documentation/BrickDocumentation/PlayNoteForBeats/": {
                    "text": "Play Note For Beats: This brick plays the specified note for the specified ammount of beats. The duration of a beat depends on the tempo."
                },
                "/bin/view/Documentation/BrickDocumentation/PlayDrumForBeats/": {
                    "text": "Play Drum For Beats: Plays the specified drum for the specified ammount of beats. The duration of a beat depends on the tempo."
                },
                "/bin/view/Documentation/BrickDocumentation/SetTempoBrick/": {
                    "text": "Set Tempo Brick: This brick sets the tempo of the notes played. A higher tempo correlates to a the notes beeing played faster."
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeTempo/": {
                    "text": "Change Tempo: This brick changes the current tempo by the specified ammount."
                },
                "/bin/view/Documentation/BrickDocumentation/PauseForBeatsBrick/": {
                    "text": "Pause For Beats Brick: This brick is similar to the \"Wait-for-seconds\"-brick. He blocks the current sound for the specified ammount of beats. The duration of a beat depends on the tempo."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Look-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/SetLookBrick/": {
                    "text": "Set Look Brick: Changes the look of an object to a specified one. The object needs more than one look."
                },
                "/bin/view/Documentation/BrickDocumentation/SetLookByIndexBrick/": {
                    "text": "Set Look By Index Brick: Changes the look of an object to a specified look using its number. The object needs more than one look. Looks are sorted from top to bottom as they appear in the looks-list. If you change the order of the looks, the numbers will change and the brick will show a different look."
                },
                "/bin/view/Documentation/BrickDocumentation/NextLookBrick/": {
                    "text": "Next Look Brick: Switches to the next look in the object’s look list (this can also be the background). The object needs more than one look."
                },
                "/bin/view/Documentation/BrickDocumentation/PreviousLookBrick/": {
                    "text": "Previous Look Brick: Switches to the previous look in the object’s look list (this can also be the background). The object needs more than one look."
                },
                "/bin/view/Documentation/BrickDocumentation/SetSizeToBrick/": {
                    "text": "Set Size To Brick: Sets the object’s size to a specified percent size of the original size."
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeSizeByNBrick/": {
                    "text": "Change Size By N Brick: Changes the object’s size by a specified amount."
                },
                "/bin/view/Documentation/BrickDocumentation/HideBrick/": {
                    "text": "Hide Brick: Lets an object disappear from screen. When an object is hidden, other objects cannot detect it with touching-bricks."
                },
                "/bin/view/Documentation/BrickDocumentation/ShowBrick/": {
                    "text": "Show Brick: Lets an object appear on screen after it was hidden. By default all objects are shown."
                },
                "/bin/view/Documentation/BrickDocumentation/AskBrick/": {
                    "text": "Ask Brick: Asks a question within a dialog and stores the answer in a variable."
                },
                "/bin/view/Documentation/BrickDocumentation/SayBubbleBrick/": {
                    "text": "Say Bubble Brick: Says words in a speech bubble like this: "
                },
                "/bin/view/Documentation/BrickDocumentation/SayForBubbleBrick/": {
                    "text": "Say For Bubble Brick: Says words in a speech bubble for a specified amount of time. This is how the bubble looks like: "
                },
                "/bin/view/Documentation/BrickDocumentation/ThinkBubbleBrick/": {
                    "text": "Think Bubble Brick: Displays text in a thought bubble like this: "
                },
                "/bin/view/Documentation/BrickDocumentation/ThinkForBubbleBrick/": {
                    "text": "Think For Bubble Brick: Displays words in a thought bubble for a specified amount of time. This is how the bubble looks like: "
                },
                "/bin/view/Documentation/BrickDocumentation/ShowTextBrick/": {
                    "text": "Show Text Brick: Shows a variable at a specified position."
                },
                "/bin/view/Documentation/BrickDocumentation/ShowTextColorSizeAlignmentBrick/": {
                    "text": "Show Text Color Size Alignment Brick: Shows a variable at a specified position, size, color and alignment. "
                },
                "/bin/view/Documentation/BrickDocumentation/SetTransparencyBrick/": {
                    "text": "Set Transparency Brick: Sets the object’s transparency to a specified value between 0 and 100%, whereby 100% means the object is completely transparent."
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeTransparencyByNBrick/": {
                    "text": "Change Transparency By N Brick: Changes the object’s transparency by a specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/SetBrightnessBrick/": {
                    "text": "Set Brightness Brick: Sets the object’s brightness to a specified value.  "
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeBrightnessByNBrick/": {
                    "text": "Change Brightness By N Brick: Changes the object’s brightness by a specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/SetColorBrick/": {
                    "text": "Set Color Brick: Sets the color of an object to a specified value. Does not work with grayscale objects."
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeColorByNBrick/": {
                    "text": "Change Color By N Brick: Changes the color of an object by a specified value. Does not work with grayscale objects."
                },
                "/bin/view/Documentation/BrickDocumentation/ClearGraphicEffectBrick/": {
                    "text": "Clear Graphic Effect Brick: Clears all graphic effects, like brightness, transparency and color, that are currently applied to the object."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenBackgroundChangesBrick/": {
                    "text": "When Background Changes Brick: Runs the script when background changes to a certain background. Needs more than one background."
                },
                "/bin/view/Documentation/BrickDocumentation/SetBackgroundBrick/": {
                    "text": "Set Background Brick: Switches the background to a specified background. Requires dedicated backgrounds."
                },
                "/bin/view/Documentation/BrickDocumentation/SetBackgroundByIndexBrick/": {
                    "text": "Set Background By Index Brick: Switches the background to a specified background using its number. Requires dedicated backgrounds. Backgrounds are sorted from top to bottom as they appear in the backgrounds-list. If you change the order of the backgrounds, the numbers will change and the brick will show a different background."
                },
                "/bin/view/Documentation/BrickDocumentation/SetBackgroundAndWaitBrick/": {
                    "text": "Set Background And Wait Brick: Sets the background to a specified one and waits until the correlated brick has finished before continuing its own script."
                },
                "/bin/view/Documentation/BrickDocumentation/SetBackgroundByIndexAndWaitBrick/": {
                    "text": "Set Background By Index And Wait Brick: Changes the X-coordinate of an object by a specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/CameraBrick/": {
                    "text": "Camera Brick: Turns the camera on or off. By default the front camera will be activated. To change the camera, use the correlated brick."
                },
                "/bin/view/Documentation/BrickDocumentation/ChooseCameraBrick/": {
                    "text": "Choose Camera Brick: Switches the camera to the front or back camera."
                },
                "/bin/view/Documentation/BrickDocumentation/FlashBrick/": {
                    "text": "Flash Brick: Switches the flashlight of the smartphone on or off. Does not work with the front camera."
                },
                "/bin/view/Documentation/BrickDocumentation/LookRequestBrick/": {
                    "text": "Look Request Brick: Gets an image from a specified URL and uses it as current look for the object. Requires internet connection."
                },
                "/bin/view/Documentation/BrickDocumentation/BackgroundRequestBrick/": {
                    "text": "Background Request Brick: Gets an image from a specified URL and uses it as current background. Requires internet connection."
                },
                "/bin/view/Documentation/BrickDocumentation/PaintNewLook/": {
                    "text": "Paint New Look: This brick enables you to create a new Look and add it to the looks of the object."
                },
                "/bin/view/Documentation/BrickDocumentation/EditLook/": {
                    "text": "Edit Look: This brick enables you to edit the current look of the object."
                },
                "/bin/view/Documentation/BrickDocumentation/CopyLookAndName/": {
                    "text": "Copy Look And Name: This brick creates a copy of the current look and names it after the provided value."
                },
                "/bin/view/Documentation/BrickDocumentation/DeleteLook/": {
                    "text": "Delete Look: This brick enables you to delete the current look of the object."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Pen-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/PenDownBrick/": {
                    "text": "Pen Down Brick: Puts down object’s pen, so that the object will draw as it moves."
                },
                "/bin/view/Documentation/BrickDocumentation/PenUpBrick/": {
                    "text": "Pen Up Brick: Pulls up object’s pen, so it won’t draw as it moves."
                },
                "/bin/view/Documentation/BrickDocumentation/SetPenSizeBrick/": {
                    "text": "Set Pen Size Brick: Sets pen’s thickness to a specified value."
                },
                "/bin/view/Documentation/BrickDocumentation/SetPenColorBrick/": {
                    "text": "Set Pen Color Brick: Sets pen’s color, based on choice from RGB color values."
                },
                "/bin/view/Documentation/BrickDocumentation/StampBrick/": {
                    "text": "Stamp Brick: Stamps the object’s image onto the screen. A stamp is only a temporary image of the object that is drawn on the screen. It can be drawn over or cleared using the clear-brick. A stamp cannot move and cannot hold scripts."
                },
                "/bin/view/Documentation/BrickDocumentation/ClearBackgroundBrick/": {
                    "text": "Clear Background Brick: Clears all pen marks and stamps from the screen."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Data-Bricks/": {
                "/bin/view/XWiki/Riza%20oZ": {},
                "/bin/view/Documentation/BrickDocumentation/SetVariableBrick/": {
                    "text": "Set Variable Brick: Sets a variable to a specified amount. By default, variables will be set to 0 when starting a program."
                },
                "/bin/view/Documentation/BrickDocumentation/ChangeVariableBrick/": {
                    "text": "Change Variable Brick: Changes a variable by specified amount."
                },
                "/bin/view/Documentation/BrickDocumentation/ShowTextBrick/": {
                    "text": "Show Text Brick: Shows a variable at a specified position."
                },
                "/bin/view/Documentation/BrickDocumentation/ShowTextColorSizeAlignmentBrick/": {
                    "text": "Show Text Color Size Alignment Brick: Shows a variable at a specified position, size, color and alignment. "
                },
                "/bin/view/Documentation/BrickDocumentation/HideVariable/": {
                    "text": "Hide Variable: Hides a variable. Only works if the variable was shown before."
                },
                "/bin/view/Documentation/BrickDocumentation/WriteVariableOnDeviceBrick/": {
                    "text": "Write Variable On Device Brick: Stores the specified variable on the devices storage. This means that variables can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled."
                },
                "/bin/view/Documentation/BrickDocumentation/ReadVariableFromDeviceBrick/": {
                    "text": "Read Variable From Device Brick: Reads a specified variable from the devices storage. This means that variables can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled."
                },
                "/bin/view/Documentation/BrickDocumentation/WriteVariableToFileBrick/": {
                    "text": "Write Variable To File Brick: Writes a specified variable to a specified file. This means that variables can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled. Only a single variable can be read from each file. You can find the file in the Catrobat root directory."
                },
                "/bin/view/Documentation/BrickDocumentation/ReadVariableFromFileBrick/": {
                    "text": "Read Variable From File Brick: Reads a specified variable from a specified file and either keeps or deletes the file. This means that variables can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled. Only a single variable can be read from each file. You can find the file in the Catrobat root directory."
                },
                "/bin/view/Documentation/BrickDocumentation/AddItemToUserListBrick/": {
                    "text": "Add Item To User List Brick: Adds a specified value to a list and stores it in numerical order. New inputs will be put at the end of the list."
                },
                "/bin/view/Documentation/BrickDocumentation/DeleteItemOfUserListBrick/": {
                    "text": "Delete Item Of User List Brick: Deletes an item from a specified list and position. Other items will move up in their list position."
                },
                "/bin/view/Documentation/BrickDocumentation/ClearUserListBrick/": {
                    "text": "Clear User List Brick: Deletes all items from a specified list."
                },
                "/bin/view/Documentation/BrickDocumentation/InsertItemIntoUserListBrick/": {
                    "text": "Insert Item Into User List Brick: Inserts a new item into a specified list and position. Following items will move down one position."
                },
                "/bin/view/Documentation/BrickDocumentation/ReplaceItemInUserListBrick/": {
                    "text": "Replace Item In User List Brick: Replaces one item on a specified position with a new item. The new item will take the position from the other one."
                },
                "/bin/view/Documentation/BrickDocumentation/WriteListOnDeviceBrick/": {
                    "text": "Write List On Device Brick: Writes a specified list on the devices storage. This means that lists can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled."
                },
                "/bin/view/Documentation/BrickDocumentation/ReadListFromDeviceBrick/": {
                    "text": "Read List From Device Brick: Reads a specified list from the devices storage. This means that lists can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled."
                },
                "/bin/view/Documentation/BrickDocumentation/StoreCSVIntoUserListBrick/": {
                    "text": "Store C S V Into User List Brick: Stores a specified column of CSV (comma-separated values) data into a specified list. Every element of the specified column will be added as individual item into the list."
                },
                "/bin/view/Documentation/BrickDocumentation/WebRequestBrick/": {
                    "text": "Web Request Brick: Sends a web request to a specified address (URL). Stores the answer in a specified variable."
                },
                "/bin/view/Documentation/BrickDocumentation/LookRequestBrick/": {
                    "text": "Look Request Brick: Gets an image from a specified URL and uses it as current look for the object. Requires internet connection."
                },
                "/bin/view/Documentation/BrickDocumentation/BackgroundRequestBrick/": {
                    "text": "Background Request Brick: Gets an image from a specified URL and uses it as current background. Requires internet connection."
                },
                "/bin/view/Documentation/BrickDocumentation/AskBrick/": {
                    "text": "Ask Brick: Asks a question within a dialog and stores the answer in a variable."
                },
                "/bin/view/Documentation/BrickDocumentation/AskSpeechBrick/": {
                    "text": "Ask Speech Brick: Speaks a phrase with a computer generated voice and stores the spoken answer, converted as text, in a variable. Requires an internet connection to convert."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Your-Bricks/": {
                "/bin/view/XWiki/admin": {},
                "/bin/view/Documentation/BrickDocumentation/Your-Bricks/Your%20Brick%20Examples/": {}
            },
            "/bin/view/Documentation/BrickDocumentation/Embroidery-Bricks/": {
                "/bin/view/XWiki/MichaelJ": {},
                "/bin/view/Education/Embroidery/": {
                    "text": "Education Embroidery: On this page, you will find all the tutorials you need to start programming. We have both videos and step by step instructions for you. "
                },
                "/bin/view/Documentation/BrickDocumentation/StitchBrick/": {
                    "text": "Stitch Brick: Stitch lets the machine stitch into the fabric once. You will recognise this as a black point on your screen."
                },
                "/bin/view/Documentation/BrickDocumentation/RunningStitchBrick/": {
                    "text": "Running Stitch Brick: The running stitch activates a continous stitching as long as it is not stopped. Every time the machine is moved, it will stich at the specified length."
                },
                "/bin/view/Documentation/BrickDocumentation/ZigZagStitchBrick/": {
                    "text": "Zig Zag Stitch Brick: Starts a zigzag sitch with a specified length and width. The machine will then stitch continuously with every movement. The zigzag stitch enables you to stitch thicker seams. "
                },
                "/bin/view/Documentation/BrickDocumentation/TripleStitchBrick/": {
                    "text": "Triple Stitch Brick: The triple stitch works the same as the running stitch, but it sews up every stitch three times. So it will move one step back after the first stitch, stitch, and then move one step forward again."
                },
                "/bin/view/Documentation/BrickDocumentation/StopCurrentStitchBrick/": {
                    "text": "Stop Current Stitch Brick: If you start a continous stitch, like running, triple or zigzag stitch, it can only be stopped with this brick. This allows you e.g. to move the machine without stitching and then continue to stitch."
                },
                "/bin/view/Documentation/BrickDocumentation/WriteEmbroideryToFileBrick/": {
                    "text": "Write Embroidery To File Brick: Writes the programed embroidery file to a specified file. Embroidery patterns are created in the DST file format. You can then export this file to stitch with electronic stitching machines."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Lego-NXT-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/LegoNxtMotorTurnAngleBrick/": {
                    "text": "Lego Nxt Motor Turn Angle Brick: Activates the selected motor(s) and stops the motor(s) again after it spun for the entered angle. It is possible to select each output-port separately or use the two output-ports B and C at the same time. The direction the motor(s) will spin is controlled by positive/negative values of the entered angle."
                },
                "/bin/view/Documentation/BrickDocumentation/LegoNxtMotorStopBrick/": {
                    "text": "Lego Nxt Motor Stop Brick: Stops the movement of the selected motor(s). It is possible to select each output-port separately or use the two output-ports B and C or all output-ports at the same time."
                },
                "/bin/view/Documentation/BrickDocumentation/LegoNxtMotorMoveBrick/": {
                    "text": "Lego Nxt Motor Move Brick: Activates the selected motor(s) and spins the motor(s) with the entered speed until a stop-command is issued to the motor(s). It is possible to select each output-port separately or use the two output-ports B and C at the same time. The direction the motor(s) will spin is controlled by positive/negative values of the entered speed."
                },
                "/bin/view/Documentation/BrickDocumentation/LegoNxtPlayToneBrick/": {
                    "text": "Lego Nxt Play Tone Brick: Plays a tone on the NXT brick for the entered duration in the entered frequency. The NXT brick supports frequencies between 200Hz and 14000Hz."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Lego-Ev3-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/LegoEv3MotorMoveBrick/": {
                    "text": "Lego Ev3 Motor Move Brick: Activates the selected motor(s) and spins the motor(s) with the entered speed until a stop-command is issued to the motor(s). It is possible to select each output-port separately or use the two output-ports B and C at the same time. The direction the motor(s) will spin is controlled by positive/negative values of the entered speed."
                },
                "/bin/view/Documentation/BrickDocumentation/LegoEv3MotorStopBrick/": {
                    "text": "Lego Ev3 Motor Stop Brick: Stops the movement of the selected motor(s). It is possible to select each output-port separately or use the two output-ports B and C or all output-ports at the same time."
                },
                "/bin/view/Documentation/BrickDocumentation/LegoEv3MotorTurnAngleBrick/": {
                    "text": "Lego Ev3 Motor Turn Angle Brick: Activates the selected motor(s) and stops the motor(s) again after it spun for the entered angle. It is possible to select each output-port separately or use the two output-ports B and C at the same time. The direction the motor(s) will spin is controlled by positive/negative values of the entered angle."
                },
                "/bin/view/Documentation/BrickDocumentation/LegoEv3SetLedBrick/": {
                    "text": "Lego Ev3 Set Led Brick: Changes the color of the LEDs of the EV3 Brick. You can chose between the colors green, red and orange. For all three colors the options on, flashing or pulse are available. It is also possible to turn off the LEDs."
                },
                "/bin/view/Documentation/BrickDocumentation/LegoEv3PlayToneBrick/": {
                    "text": "Lego Ev3 Play Tone Brick: Plays a tone on the EV3 brick for the entered duration in the entered frequency. The EV3 brick supports frequencies between 200Hz and 10000Hz. The volume of the sound can be entered in percent."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/AR%20Drone/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/DroneTakeOffLandBrick/": {
                    "text": "Drone Take Off Land Brick: Take off the drone and waits in the start position about one meter distance to the ground. This brick is necessary for the move, turn and flip bricks. If the drone is flying, this brick activates the landing on the ground."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneEmergencyBrick/": {
                    "text": "Drone Emergency Brick: Turns off all motors and the drone switch over to emergency mode. In this mode the lights shine red and no other command can be executed. Attention in high altitude! After a restart the drone returns to normal flight mode."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneMoveUpBrick/": {
                    "text": "Drone Move Up Brick: Moves the drone up with the entered time and power. The percentage of the power with the value 100 is the maximum airspeed of the drone and the percentage downwards to the value 0 calculates the slower speed."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneMoveDownBrick/": {
                    "text": "Drone Move Down Brick: Moves the drone down with the entered time and power. The percentage of the power with the value 100 is the maximum airspeed of the drone and the percentage downwards to the value 0 calculates the slower speed."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneMoveLeftBrick/": {
                    "text": "Drone Move Left Brick: Moves the drone left with the entered time and power. The percentage of the power with the value 100 is the maximum airspeed of the drone and the percentage downwards to the value 0 calculates the slower speed."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneMoveRightBrick/": {
                    "text": "Drone Move Right Brick: Moves the drone right with the entered time and power. The percentage of the power with the value 100 is the maximum airspeed of the drone and the percentage downwards to the value 0 calculates the slower speed."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneMoveForwardBrick/": {
                    "text": "Drone Move Forward Brick: Moves the drone forward with the entered time and power. The percentage of the power with the value 100 is the maximum airspeed of the drone and the percentage downwards to the value 0 calculates the slower speed."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneMoveBackwardBrick/": {
                    "text": "Drone Move Backward Brick: Moves the drone backward with the entered time and power. The percentage of the power with the value 100 is the maximum airspeed of the drone and the percentage downwards to the value 0 calculates the slower speed."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneTurnLeftBrick/": {
                    "text": "Drone Turn Left Brick: Turns the drone left with the entered time and power. While the drone turns, it stays in the same position. The percentage of the power with the value 100 is the maximum rotation velocity of the drone and the percentage downwards to the value 0 calculates the slower velocity."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneTurnRightBrick/": {
                    "text": "Drone Turn Right Brick: Turns the drone right with the entered time and power. While the drone turns, it stays in the same position. The percentage of the power with the value 100 is the maximum rotation velocity of the drone and the percentage downwards to the value 0 calculates the slower velocity."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneFlipBrick/": {
                    "text": "Drone Flip Brick: Flips the drone to the left and roll it around its own axis. After that, the drone returns back to the position where the brick was started."
                },
                "/bin/view/Documentation/BrickDocumentation/DronePlayLedAnimationBrick/": {
                    "text": "Drone Play Led Animation Brick: The four LED lamps of the drone shine in different colors and animation modes. There are many different colors and animations, such as \"Green\", \"Red\", \"Blink Green\", \"Fire\". All these flash animations take five seconds."
                },
                "/bin/view/Documentation/BrickDocumentation/DroneSwitchCameraBrick/": {
                    "text": "Drone Switch Camera Brick: Switches between the two drone cameras. The main camera shows the view to the front and the second camera to the ground. Additionally, choose from the \"Looks\" category the \"Set background (AR.Drone 2.0 video)\" brick to display the video from the drone camera."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Jumping%20Sumo%20Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoMoveForwardBrick/": {
                    "text": "Jumping Sumo Move Forward Brick: Moves the drone forward with the entered time and power. The percentage of the power with the value 100 is the maximum driving speed of the drone and the percentage downwards to the value 0 calculates the slower speed."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoMoveBackwardBrick/": {
                    "text": "Jumping Sumo Move Backward Brick: Moves the drone backward with the entered time and power. The percentage of the power with the value 100 is the maximum driving speed of the drone and the percentage downwards to the value 0 calculates the slower speed."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoAnimationsBrick/": {
                    "text": "Jumping Sumo Animations Brick: The drone supports many different funny animations, such as \"Spin\", \"Slowshake\", \"Spinjump\"."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoSoundBrick/": {
                    "text": "Jumping Sumo Sound Brick: Different sounds can be selected, like \"Normal\", \"Robot\", \"Insect\" and \"Monster\". If the sound is activated, the drone continues every other brick with this chosen sound and volume."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoNoSoundBrick/": {
                    "text": "Jumping Sumo No Sound Brick: Turns off the sound."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoJumpLongBrick/": {
                    "text": "Jumping Sumo Jump Long Brick: The drone jumps forward and lands after a distance about one meter on the ground. In the upside down position, the drone can kick a ball."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoJumpHighBrick/": {
                    "text": "Jumping Sumo Jump High Brick: The drone jumps up about eighty centimeter and lands on the ground. In the upside down position, the drone can kick a ball."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoRotateLeftBrick/": {
                    "text": "Jumping Sumo Rotate Left Brick: Turns the drone to the left with the entered degree measure."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoRotateRightBrick/": {
                    "text": "Jumping Sumo Rotate Right Brick: Turns the drone to the right with the entered degree measure."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoTurnBrick/": {
                    "text": "Jumping Sumo Turn Brick: Flips the drone around its own axis and stays in the upside down position. In this position, the drone can also do all other bricks. If the drone is in the upside down position, this brick turns the drone to the normal driving position."
                },
                "/bin/view/Documentation/BrickDocumentation/JumpingSumoTakingPictureBrick/": {
                    "text": "Jumping Sumo Taking Picture Brick: Takes a picture with the drone camera and stores it to the internal storage of your own device. This brick creates a new folder \"JumpingSumo\" in the general photo directory and stores all further pictures from the drone there."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Arduino-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/ArduinoSendDigitalValueBrick/": {
                    "text": "Arduino Send Digital Value Brick: Sets the specified Pin to the specified value. For this brick only the values 0 (false / low) and 1 (true / high) work, otherwise the brick has no effect."
                },
                "/bin/view/Documentation/BrickDocumentation/ArduinoSendPWMValueBrick/": {
                    "text": "Arduino Send P W M Value Brick: Sets the specified Pin to the specified PWN duty cycle and frequency. More information on PWM can be found here."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Raspberry%20Pi-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/Raspberry%20Pi-Bricks/Connecting%20to%20the%20Pi/": {
                    "text": "Raspberry%20 Pi- Bricks Connecting%20to%20the%20 Pi: Installing RaspberinoServer on your Raspberry PiFor the following steps, you either have to enter the following commands in the terminal of your Paspberry Pi using a keyboard and a display, or you can connect to your Raspberry Pi via SSH from your computer or phone."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenRaspiPinChangedBrick/": {
                    "text": "When Raspi Pin Changed Brick: Waits until the specified Pin changes its state to the specified value and executes the script. High corresponds to the value 1 and low to the value 0."
                },
                "/bin/view/Documentation/BrickDocumentation/RaspiIfLogicBeginBrick/": {
                    "text": "Raspi If Logic Begin Brick: Creates an if-else-query. If the specified Pin is true (a.k.a. high or 1) it will continue the script there, otherwise it will continue with the else-brick beneath."
                },
                "/bin/view/Documentation/BrickDocumentation/RaspiSendDigitalValueBrick/": {
                    "text": "Raspi Send Digital Value Brick: Sets the specified Pin to the specified value. For this brick only the values 0 (false / low) and 1 (true / high) work, otherwise the brick has no effect."
                },
                "/bin/view/Documentation/BrickDocumentation/RaspiPwmBrick/": {
                    "text": "Raspi Pwm Brick: Sets the specified Pin to the specified PWM duty cycle and frequency. More information on PWM can be found here."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Phiro-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/PhiroMotorMoveForwardBrick/": {
                    "text": "Phiro Motor Move Forward Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/PhiroMotorMoveBackwardBrick/": {
                    "text": "Phiro Motor Move Backward Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/PhiroMotorStopBrick/": {
                    "text": "Phiro Motor Stop Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/PhiroPlayToneBrick/": {
                    "text": "Phiro Play Tone Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/PhiroRGBLightBrick/": {
                    "text": "Phiro R G B Light Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/PhiroIfLogicBeginBrick/": {
                    "text": "Phiro If Logic Begin Brick: Work In Progress"
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Testing-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/AssertEqualsBrick/": {
                    "text": "Assert Equals Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/AssertUserListsBrick/": {
                    "text": "Assert User Lists Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/ParameterizedBrick/": {
                    "text": "Parameterized Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/WaitTillIdleBrick/": {
                    "text": "Wait Till Idle Brick: Let’s the script wait until all other scripts have stopped. This includes all script from all other objects. Scripts can be stopped through the stop brick or when terminated by lack of further operations. "
                },
                "/bin/view/Documentation/BrickDocumentation/TapAtBrick/": {
                    "text": "Tap At Brick: Simulates a single tap at a specified position of the touchscreen. This brick basically simulates your finger."
                },
                "/bin/view/Documentation/BrickDocumentation/TapForBrick/": {
                    "text": "Tap For Brick: Simulates a touch at a specified position for a specified amount of time at your touchscreen. This brick basically simulates your finger and can be used for longer touches."
                },
                "/bin/view/Documentation/BrickDocumentation/FinishStageBrick/": {
                    "text": "Finish Stage Brick: Work In Progress"
                },
                "/bin/view/Documentation/BrickDocumentation/StoreCSVIntoUserListBrick/": {
                    "text": "Store C S V Into User List Brick: Stores a specified column of CSV (comma-separated values) data into a specified list. Every element of the specified column will be added as individual item into the list."
                },
                "/bin/view/Documentation/BrickDocumentation/WebRequestBrick/": {
                    "text": "Web Request Brick: Sends a web request to a specified address (URL). Stores the answer in a specified variable."
                }
            },
            "/bin/view/Documentation/BrickDocumentation/Device-Bricks/": {
                "/bin/view/XWiki/stephan": {},
                "/bin/view/Documentation/BrickDocumentation/WhenBrick/": {
                    "text": "When Brick: Runs the script when the object is tapped."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenTouchDownBrick/": {
                    "text": "When Touch Down Brick: Runs the script when the screen is touched."
                },
                "/bin/view/Documentation/BrickDocumentation/WhenNfcBrick/": {
                    "text": "When Nfc Brick: Text"
                },
                "/bin/view/Documentation/BrickDocumentation/SetNfcTagBrick/": {
                    "text": "Set Nfc Tag Brick: Text"
                },
                "/bin/view/Documentation/BrickDocumentation/WebRequestBrick/": {
                    "text": "Web Request Brick: Sends a web request to a specified address (URL). Stores the answer in a specified variable."
                },
                "/bin/view/Documentation/BrickDocumentation/LookRequestBrick/": {
                    "text": "Look Request Brick: Gets an image from a specified URL and uses it as current look for the object. Requires internet connection."
                },
                "/bin/view/Documentation/BrickDocumentation/VibrationBrick/": {
                    "text": "Vibration Brick: Lets the phone vibrate for a specified time."
                },
                "/bin/view/Documentation/BrickDocumentation/SpeakBrick/": {
                    "text": "Speak Brick: Speaks a phrase with a computer generated voice and continues with the next brick immediately."
                },
                "/bin/view/Documentation/BrickDocumentation/SpeakAndWaitBrick/": {
                    "text": "Speak And Wait Brick: Speaks a phrase with a computer generated voice and waits until it has ended before continuing with the next brick."
                },
                "/bin/view/Documentation/BrickDocumentation/AskSpeechBrick/": {
                    "text": "Ask Speech Brick: Speaks a phrase with a computer generated voice and stores the spoken answer, converted as text, in a variable. Requires an internet connection to convert."
                },
                "/bin/view/Documentation/BrickDocumentation/StartListeningBrick/": {
                    "text": "Start Listening Brick: Starts the voice recognition and stores the recognised words in the specified variable. The recognition will stop automatically if there is nothing spoken anymore."
                },
                "/bin/view/Documentation/BrickDocumentation/CameraBrick/": {
                    "text": "Camera Brick: Turns the camera on or off. By default the front camera will be activated. To change the camera, use the correlated brick."
                },
                "/bin/view/Documentation/BrickDocumentation/ChooseCameraBrick/": {
                    "text": "Choose Camera Brick: Switches the camera to the front or back camera."
                },
                "/bin/view/Documentation/BrickDocumentation/FlashBrick/": {
                    "text": "Flash Brick: Switches the flashlight of the smartphone on or off. Does not work with the front camera."
                },
                "/bin/view/Documentation/BrickDocumentation/WriteVariableOnDeviceBrick/": {
                    "text": "Write Variable On Device Brick: Stores the specified variable on the devices storage. This means that variables can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled."
                },
                "/bin/view/Documentation/BrickDocumentation/ReadVariableFromDeviceBrick/": {
                    "text": "Read Variable From Device Brick: Reads a specified variable from the devices storage. This means that variables can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled."
                },
                "/bin/view/Documentation/BrickDocumentation/WriteListOnDeviceBrick/": {
                    "text": "Write List On Device Brick: Writes a specified list on the devices storage. This means that lists can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled."
                },
                "/bin/view/Documentation/BrickDocumentation/ReadListFromDeviceBrick/": {
                    "text": "Read List From Device Brick: Reads a specified list from the devices storage. This means that lists can be stored permanently, surviving the lifetime of the Pocket Code App and later can be recalled."
                },
                "/bin/view/Documentation/BrickDocumentation/TapAtBrick/": {
                    "text": "Tap At Brick: Simulates a single tap at a specified position of the touchscreen. This brick basically simulates your finger."
                },
                "/bin/view/Documentation/BrickDocumentation/TapForBrick/": {
                    "text": "Tap For Brick: Simulates a touch at a specified position for a specified amount of time at your touchscreen. This brick basically simulates your finger and can be used for longer touches."
                }
            }
        },
        "/bin/view/Documentation/FormulaEditor/": {},
        "/bin/view/Documentation/How-To%27s/": {},
        "/bin/view/Documentation/Feature%20Tutorials/": {},
        "/bin/view/Documentation/Starter/": {},
        "/bin/view/Documentation/Beginners%20Course/": {},
        "/bin/view/Documentation/Game%20Design/": {},
        "/bin/view/Documentation/Chat%20and%20Forums/": {},
        "/bin/view/Documentation/Web%20requests/": {},
        "/bin/view/Documentation/AFirstGame/": {}
    }
}